Revit 2024 API
ParameterUtils.GetBuiltInParameter Method
 Gets the BuiltInParameter value corresponding to built-in parameter identified by the given ForgeTypeId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static BuiltInParameter GetBuiltInParameter(
	ForgeTypeId parameterTypeId
)
Visual Basic
Public Shared Function GetBuiltInParameter ( _
	parameterTypeId As ForgeTypeId _
) As BuiltInParameter
Visual C++
public:
static BuiltInParameter GetBuiltInParameter(
	ForgeTypeId^ parameterTypeId
)
Parameters
parameterTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
The parameter identifier.
Return Value
The BuiltInParameter value corresponding to the given parameter identifier.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  parameterTypeId is not a built-in parameter identifier. See IsBuiltInParameter(ForgeTypeId) and GetParameterTypeId(BuiltInParameter).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace